5-2-chips--rails-intro/rottenpotatoes-rails-intro-1/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    if params[:ratings] == nil && params[:sort] == nil #+something in seesion
      redirect_to movies_path(:sort => session[:sort], :ratings => session[:ratings])
    end




    @ratings_to_show =  params[:ratings] || {'G'=>'1','PG'=>'1','PG-13'=>'1','R'=>'1' }
    session[:ratings] = @ratings_to_show

    if params[:sort] != nil
      session[:sort] = params[:sort]
    end

    order = session[:sort] || nil
    if order == 'title'
      @title_header =  'hilite bg-warning'
    elsif order == 'release_date'
      @release_date_header = 'hilite bg-warning'
    end

    @movies = Movie.with_ratings(@ratings_to_show.keys).order(order)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')